tap "aws/tap"
tap "boz/repo"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "mongodb/brew"
tap "weaveworks/tap"
brew "xz"
brew "openssl@3"
brew "autoconf"
brew "automake"
brew "libyaml"
brew "readline"
brew "aws-elasticbeanstalk"
brew "aws-sam-cli"
brew "awscli"
brew "bash-completion@2"
brew "bat"
brew "binutils"
brew "pkg-config"
brew "p7zip"
brew "binwalk"
brew "bitwarden-cli"
brew "btop"
brew "cfn-lint"
brew "cifer"
brew "coreutils"
brew "curl"
brew "dns2tcp"
brew "dnsmasq"
brew "docker-machine-driver-vmware"
brew "fcrackzip"
brew "fd"
brew "findutils"
brew "foremost"
brew "libtool"
brew "fzf"
brew "git"
brew "git-flow-avh"
brew "gnu-sed"
brew "netpbm"
brew "graphviz"
brew "grep"
brew "hashpump"
brew "helm"
brew "httpie", args: ["HEAD"]
brew "imagemagick"
brew "john"
brew "jq"
brew "knock"
brew "kubernetes-cli"
brew "lazydocker"
brew "libksba"
brew "media-info"
brew "moreutils"
brew "neovim"
brew "nmap"
brew "openssh"
brew "php"
brew "zopfli"
brew "pigz"
brew "pngcheck"
brew "putty"
brew "rename"
brew "ripgrep"
brew "screen"
brew "socat"
brew "sqlmap"
brew "ssh-copy-id"
brew "tcpflow"
brew "tcpreplay"
brew "tcptrace"
brew "terraform"
brew "testssl"
brew "watch"
brew "webkit2png"
brew "wget"
brew "zlib"
brew "zsh"
brew "mongodb/brew/mongodb-database-tools"
brew "weaveworks/tap/eksctl"
cask "anydesk"
cask "brave-browser"
cask "docker"
cask "gpg-suite"
cask "iterm2"
cask "itsycal"
cask "keycastr"
cask "microsoft-remote-desktop"
cask "obsidian"
cask "postman"
cask "rocket-chat"
cask "shortcat"
cask "skype"
cask "slack"
cask "studio-3t"
cask "visual-studio-code"
cask "visualvm"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "ahmadawais.shades-of-purple"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "amirHA.better-comments-2"
vscode "anweber.vscode-httpyac"
vscode "apollographql.vscode-apollo"
vscode "aws-scripting-guy.cform"
vscode "bbenoist.vagrant"
vscode "bmewburn.vscode-intelephense-client"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-faker"
vscode "doggy8088.spring-boot-snippets"
vscode "dotenv.dotenv-vscode"
vscode "dsznajder.es7-react-js-snippets"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "ggrebert.quarkus-snippets"
vscode "GitHub.remotehub"
vscode "golang.go"
vscode "googlecloudtools.cloudcode"
vscode "GrapeCity.gc-excelviewer"
vscode "Gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "jeroen-meijer.pubspec-assist"
vscode "johnpapa.pwa-tools"
vscode "kisstkondoros.vscode-codemetrics"
vscode "liamhammett.inline-parameters"
vscode "loiane.ts-extension-pack"
vscode "lunuan.kubernetes-templates"
vscode "MehediDracula.php-namespace-resolver"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "MicroProfile-Community.mp-rest-client-generator-vscode-ext"
vscode "MicroProfile-Community.mp-starter-vscode-ext"
vscode "MicroProfile-Community.vscode-microprofile-pack"
vscode "mindaro-dev.file-downloader"
vscode "mkhl.shfmt"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "msyrus.go-doc"
vscode "onecentlin.laravel5-snippets"
vscode "pflannery.vscode-versionlens"
vscode "PKief.material-icon-theme"
vscode "pmneo.tsimporter"
vscode "quicktype.quicktype"
vscode "redhat.apache-camel-extension-pack"
vscode "redhat.atlasmap-viewer"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-apache-camel"
vscode "redhat.vscode-camelk"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-community-server-connector"
vscode "redhat.vscode-debug-adapter-apache-camel"
vscode "redhat.vscode-kaoto"
vscode "redhat.vscode-microprofile"
vscode "redhat.vscode-openshift-connector"
vscode "redhat.vscode-quarkus"
vscode "redhat.vscode-redhat-account"
vscode "redhat.vscode-rsp-ui"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ReliableWebhook.ReliableWebhook"
vscode "richie5um2.vscode-sort-json"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "ryannaddy.laravel-artisan"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "sdras.night-owl"
vscode "skellock.just"
vscode "stringham.move-ts"
vscode "tamasfe.even-better-toml"
vscode "ThreadHeap.serverless-ide-vscode"
vscode "tintinweb.vscode-decompiler"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-concourse"
vscode "vmware.vscode-manifest-yaml"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "Vue.volar"
vscode "wix.vscode-import-cost"
vscode "xdebug.php-debug"
vscode "yoavbls.pretty-ts-errors"
