tap "amioranza/tools", trusted: true
tap "aws/tap", trusted: true
tap "boz/repo", trusted: true
tap "hashicorp/tap", trusted: true
tap "mongodb/brew", trusted: true
tap "sinelaw/fresh", trusted: true
tap "weaveworks/tap", trusted: true
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# NaCl networking and cryptography library
brew "libsodium"
# YAML Parser
brew "libyaml"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Client for Amazon Elastic Beanstalk web service
brew "aws-elasticbeanstalk"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU binary tools for native development
brew "binutils"
# Parser generator
brew "bison"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# Work on automating classical cipher cracking in C
brew "cifer"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Library for manipulating PNG images
brew "libpng"
# TIFF library and utilities
brew "libtiff"
# TCP over DNS tunnel
brew "dns2tcp"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq", restart_service: :changed
# Generate documentation for several programming languages
brew "doxygen"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# C++ template library for linear algebra
brew "eigen"
# Modern, maintained replacement for ls
brew "eza"
# Test various flash cards
brew "f3"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Zip password cracker
brew "fcrackzip"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Software library to render fonts
brew "freetype"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Generate pixel-perfect macOS folder icons in the native style
brew "folderify"
# Console program to recover files based on their headers and footers
brew "foremost"
# Text editor for your terminal: easy, powerful and fast
brew "fresh-editor"
# Command-line fuzzy finder written in Go
brew "fzf"
# Graphics library to dynamically manipulate images
brew "gd"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Audit git repos for secrets
brew "gitleaks"
# OpenGL Extension Wrangler Library
brew "glew"
# Multi-platform library for OpenGL applications
brew "glfw"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU grep, egrep and fgrep
brew "grep"
# Kubernetes package manager
brew "helm"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie", args: ["HEAD"]
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Featureful UNIX password cracker
brew "john"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Library for interacting with JSON
brew "jsoncpp"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Run local Kubernetes cluster in Docker
brew "kind"
# Port-knock server
brew "knock"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# BSD-style licensed readline alternative
brew "libedit"
# Conversion library
brew "libiconv"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# GNOME XML library
brew "libxml2"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Image manipulation
brew "netpbm"
# Port scanning utility for large networks
brew "nmap"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# General-purpose scripting language
brew "php"
# Parallel gzip
brew "pigz"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Print info and check PNG, JNG, and MNG files
brew "pngcheck"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# Modern API client that lives in your terminal
brew "posting"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Generate C-based recognizers from regular expressions
brew "re2c"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Spreadsheet program for the terminal, using ncurses
brew "sc-im"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# SOcket CAT: netcat on steroids
brew "socat"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Command-line packet analyzer
brew "tcpdump"
# TCP/IP packet demultiplexer
brew "tcpflow"
# Replay saved tcpdump files at arbitrary speeds
brew "tcpreplay"
# User interface to the TELNET protocol
brew "telnet"
# Tool which checks for the support of TLS/SSL ciphers and flaws
brew "testssl"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Terraform
brew "hashicorp/tap/terraform", trusted: true
# Terraform Stacks CLI
brew "hashicorp/tap/tfstacks", trusted: true
# This package contains standard utilities for interacting with MongoDB.
brew "mongodb/brew/mongodb-database-tools", trusted: true
# The official CLI for Amazon EKS
brew "weaveworks/tap/eksctl", trusted: true
# Allows connection to a computer remotely
cask "anydesk"
# Application uninstaller
cask "appcleaner"
# Web browser focusing on privacy
cask "brave-browser"
cask "font-jetbrains-mono-nerd-font"
# Tools to protect your emails and files
cask "gpg-suite"
# Free and open-source media player
cask "iina"
# File archiver
cask "keka"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Presentation software
cask "microsoft-powerpoint"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Word processor
cask "microsoft-word"
# Get up and running with large language models locally
cask "ollama-app"
# Android file transfer
cask "openmtp"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Official desktop client for Rocket.Chat
cask "rocket-chat"
# App that enables mouse-free UI interaction
cask "shortcat"
# Native database client for many database types
cask "tablepro"
# Open-source code editor
cask "visual-studio-code"
# All-in-One Java Troubleshooting Tool
cask "visualvm"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Native desktop client for WhatsApp
cask "whatsapp"
# Connect to Windows
cask "windows-app"
# Network protocol analyzer
cask "wireshark-app"
vscode "aaron-bond.better-comments"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anweber.vscode-httpyac"
vscode "aws-scripting-guy.cform"
vscode "blanc-frederic.vs-phpcompanion"
vscode "bmewburn.vscode-intelephense-client"
vscode "buvan.sql-crack"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "continue.continue"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-faker"
vscode "denoland.vscode-deno"
vscode "dsznajder.es7-react-js-snippets"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hediet.debug-visualizer"
vscode "ihunte.laravel-blade-wrapper"
vscode "jaguadoromero.vscode-php-create-class"
vscode "jeremyljackson.vs-docblock"
vscode "just4devs.php-create-implementation"
vscode "kamasamak.vscode-cflint"
vscode "laravel.vscode-laravel"
vscode "lunuan.kubernetes-templates"
vscode "maarti.jenkins-doc"
vscode "mehedidracula.php-namespace-resolver"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "microprofile-community.mp-rest-client-generator-vscode-ext"
vscode "microprofile-community.mp-starter-vscode-ext"
vscode "microprofile-community.vscode-microprofile-pack"
vscode "monish.regexsnippets"
vscode "mrchetan.phpstorm-parameter-hints-in-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.vscode-dotnet-modernize"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel5-snippets"
vscode "open-southeners.laravel-pint"
vscode "pflannery.vscode-versionlens"
vscode "phiter.phpstorm-snippets"
vscode "phpactor.vscode-phpactor"
vscode "plustimeit.php-file-refactoring"
vscode "pomber.git-file-history"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "redhat.vscode-microprofile"
vscode "redhat.vscode-quarkus"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "shengchen.vscode-checkstyle"
vscode "sleistner.vscode-fileutils"
vscode "socheatsok78-lab.dotenv-vscode-stripped"
vscode "sonarsource.sonarlint-vscode"
vscode "st-pham.php-refactor-tool"
vscode "sumneko.lua"
vscode "tintinweb.vscode-decompiler"
vscode "usernamehw.errorlens"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-initializr"
vscode "wix.vscode-import-cost"
vscode "xdebug.php-debug"
npm "commitizen"
npm "npm-check"
npm "opencode-ai"
npm "prettier"
npm "serve"
