tap "aws/tap"
tap "boz/repo"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
tap "weaveworks/tap"
brew "libpng"
brew "xz"
brew "openssl@3"
brew "argocd"
brew "autoconf"
brew "automake"
brew "libyaml"
brew "readline"
brew "python@3.13"
brew "aws-elasticbeanstalk"
brew "aws-sam-cli"
brew "awscli"
brew "bash-completion@2"
brew "bat"
brew "binutils"
brew "btop"
brew "cfn-lint"
brew "cifer"
brew "cmake"
brew "cmatrix"
brew "cocoapods"
brew "coreutils"
brew "curl"
brew "dns2tcp"
brew "dnsmasq"
brew "doxygen"
brew "dua-cli"
brew "eigen"
brew "eza"
brew "f3"
brew "fastfetch"
brew "fcrackzip"
brew "fd"
brew "findutils"
brew "libtool"
brew "imagemagick"
brew "folderify"
brew "foremost"
brew "fzf"
brew "git"
brew "git-extras"
brew "gitleaks"
brew "glew"
brew "glfw"
brew "gnu-sed"
brew "netpbm"
brew "graphviz"
brew "grep"
brew "helm"
brew "httpie", args: ["HEAD"]
brew "john"
brew "jq"
brew "jsoncpp"
brew "k3d"
brew "kind"
brew "knock"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "libksba"
brew "libusb"
brew "media-info"
brew "mkcert"
brew "mongosh"
brew "moreutils"
brew "neovim"
brew "nmap"
brew "openssh"
brew "p7zip"
brew "php"
brew "zopfli"
brew "pigz"
brew "pkgconf"
brew "pngcheck"
brew "qt"
brew "rename"
brew "ripgrep"
brew "screen"
brew "skaffold"
brew "socat"
brew "sqlmap"
brew "ssh-copy-id"
brew "tcpdump"
brew "tcpflow"
brew "tcpreplay"
brew "telnet"
brew "testssl"
brew "tldr"
brew "tmux"
brew "watch"
brew "webkit2png"
brew "wget"
brew "yazi"
brew "yt-dlp"
brew "zlib"
brew "zsh"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/tfstacks"
brew "mongodb/brew/mongodb-database-tools"
brew "weaveworks/tap/eksctl"
cask "anydesk"
cask "brave-browser"
cask "docker"
cask "ghostty"
cask "gpg-suite"
cask "iterm2"
cask "itsycal"
cask "keka"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "openmtp"
cask "qlmarkdown"
cask "quicklook-json"
cask "raycast"
cask "rocket-chat"
cask "shortcat"
cask "skype"
cask "visual-studio-code"
cask "visualvm"
cask "vmware-fusion"
cask "whatsapp"
cask "windows-app"
cask "wireshark"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anweber.vscode-httpyac"
vscode "aws-scripting-guy.cform"
vscode "bennycode.sort-everything"
vscode "bmewburn.vscode-intelephense-client"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "codingyu.laravel-goto-view"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-faker"
vscode "denoland.vscode-deno"
vscode "dsznajder.es7-react-js-snippets"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fey.oscura"
vscode "ggrebert.quarkus-snippets"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hediet.debug-visualizer"
vscode "ibm.output-colorizer"
vscode "ivory-lab.jenkinsfile-support"
vscode "kisstkondoros.vscode-codemetrics"
vscode "laravel.vscode-laravel"
vscode "liamhammett.inline-parameters"
vscode "lunuan.kubernetes-templates"
vscode "maarti.jenkins-doc"
vscode "mattiasbaake.vscode-snippets-for-ansible"
vscode "mechatroner.rainbow-csv"
vscode "mehedidracula.php-namespace-resolver"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "microprofile-community.mp-rest-client-generator-vscode-ext"
vscode "microprofile-community.mp-starter-vscode-ext"
vscode "microprofile-community.vscode-microprofile-pack"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "mindaro.mindaro"
vscode "monish.regexsnippets"
vscode "mrchetan.phpstorm-parameter-hints-in-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.kind-vscode"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel5-snippets"
vscode "open-southeners.laravel-pint"
vscode "pflannery.vscode-versionlens"
vscode "phpactor.vscode-phpactor"
vscode "pmneo.tsimporter"
vscode "quicktype.quicktype"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.project-initializer"
vscode "redhat.vscode-microprofile"
vscode "redhat.vscode-openshift-connector"
vscode "redhat.vscode-openshift-extension-pack"
vscode "redhat.vscode-quarkus"
vscode "redhat.vscode-redhat-account"
vscode "redhat.vscode-rsp-ui"
vscode "redhat.vscode-server-connector"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "reliablewebhook.reliablewebhook"
vscode "skellock.just"
vscode "stringham.move-ts"
vscode "sumneko.lua"
vscode "thang-nm.catppuccin-perfect-icons"
vscode "threadheap.serverless-ide-vscode"
vscode "tintinweb.vscode-decompiler"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vue.volar"
vscode "wix.vscode-import-cost"
vscode "xdebug.php-debug"
vscode "yoavbls.pretty-ts-errors"
